; domain
(define (domain zeno-travel)
(:requirements :typing)
(:types aircraft person city flevel - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (nxt ?l1 ?l2 - flevel))


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)))

(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 - flevel)
 
 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
		 (nxt ?l2 ?l1))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l2)))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 ?l3 - flevel)

 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
		 (nxt ?l2 ?l1)
		 (nxt ?l3 ?l2)
		)
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l3)
	)
) 

(:action refuel
 :parameters (?a - aircraft ?c - city ?l - flevel ?l1 - flevel)

 :precondition (and (fuel-level ?a ?l)
                 (nxt ?l ?l1)
                 (at ?a ?c))
 :effect (and (fuel-level ?a ?l1) (not (fuel-level ?a ?l))))


)

; problem
(define (problem ZTRAVEL-5-25)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	city19 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city0)
	(fuel-level plane1 fl1)
	(at plane2 city1)
	(fuel-level plane2 fl1)
	(at plane3 city16)
	(fuel-level plane3 fl5)
	(at plane4 city10)
	(fuel-level plane4 fl2)
	(at plane5 city1)
	(fuel-level plane5 fl1)
	(at person1 city19)
	(at person2 city3)
	(at person3 city6)
	(at person4 city16)
	(at person5 city13)
	(at person6 city6)
	(at person7 city0)
	(at person8 city3)
	(at person9 city13)
	(at person10 city16)
	(at person11 city2)
	(at person12 city6)
	(at person13 city8)
	(at person14 city0)
	(at person15 city8)
	(at person16 city19)
	(at person17 city9)
	(at person18 city0)
	(at person19 city1)
	(at person20 city12)
	(at person21 city8)
	(at person22 city15)
	(at person23 city4)
	(at person24 city6)
	(at person25 city17)
	(nxt fl0 fl1)
	(nxt fl1 fl2)
	(nxt fl2 fl3)
	(nxt fl3 fl4)
	(nxt fl4 fl5)
	(nxt fl5 fl6)
)
(:goal (and
	(at plane1 city11)
	(at plane2 city8)
	(at person1 city10)
	(at person2 city1)
	(at person3 city13)
	(at person4 city9)
	(at person5 city0)
	(at person6 city16)
	(at person7 city0)
	(at person8 city0)
	(at person9 city17)
	(at person10 city13)
	(at person11 city13)
	(at person12 city17)
	(at person13 city3)
	(at person14 city0)
	(at person15 city13)
	(at person16 city19)
	(at person17 city0)
	(at person18 city4)
	(at person19 city17)
	(at person20 city14)
	(at person21 city17)
	(at person22 city4)
	(at person23 city12)
	(at person24 city13)
	(at person25 city2)
	))

)

; plan
1. (board person4 plane3 city16)
   deleted: (at person4 city16)
   added: (in person4 plane3)
   goals met: 3 of 27
2. (board person10 plane3 city16)
   deleted: (at person10 city16)
   added: (in person10 plane3)
   goals met: 3 of 27
3. (board person18 plane1 city0)
   deleted: (at person18 city0)
   added: (in person18 plane1)
   goals met: 3 of 27
4. (board person19 plane5 city1)
   deleted: (at person19 city1)
   added: (in person19 plane5)
   goals met: 3 of 27
5. (fly plane3 city16 city9 fl5 fl4)
   deleted: (at plane3 city16) (fuel-level plane3 fl5)
   added: (at plane3 city9) (fuel-level plane3 fl4)
   goals met: 3 of 27
6. (board person17 plane3 city9)
   deleted: (at person17 city9)
   added: (in person17 plane3)
   goals met: 3 of 27
7. (debark person4 plane3 city9)
   deleted: (in person4 plane3)
   added: (at person4 city9)
   goals met: 4 of 27
8. (fly plane3 city9 city0 fl4 fl3)
   deleted: (at plane3 city9) (fuel-level plane3 fl4)
   added: (at plane3 city0) (fuel-level plane3 fl3)
   goals met: 4 of 27
9. (debark person17 plane3 city0)
   deleted: (in person17 plane3)
   added: (at person17 city0)
   goals met: 5 of 27
10. (fly plane2 city1 city8 fl1 fl0)
   deleted: (at plane2 city1) (fuel-level plane2 fl1)
   added: (at plane2 city8) (fuel-level plane2 fl0)
   goals met: 6 of 27
11. (fly plane4 city10 city19 fl2 fl1)
   deleted: (at plane4 city10) (fuel-level plane4 fl2)
   added: (at plane4 city19) (fuel-level plane4 fl1)
   goals met: 6 of 27
12. (board person1 plane4 city19)
   deleted: (at person1 city19)
   added: (in person1 plane4)
   goals met: 6 of 27
13. (fly plane4 city19 city10 fl1 fl0)
   deleted: (at plane4 city19) (fuel-level plane4 fl1)
   added: (at plane4 city10) (fuel-level plane4 fl0)
   goals met: 6 of 27
14. (debark person1 plane4 city10)
   deleted: (in person1 plane4)
   added: (at person1 city10)
   goals met: 7 of 27
15. (fly plane1 city0 city4 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl1)
   added: (at plane1 city4) (fuel-level plane1 fl0)
   goals met: 7 of 27
16. (refuel plane1 city4 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 7 of 27
17. (board person23 plane1 city4)
   deleted: (at person23 city4)
   added: (in person23 plane1)
   goals met: 7 of 27
18. (debark person18 plane1 city4)
   deleted: (in person18 plane1)
   added: (at person18 city4)
   goals met: 8 of 27
19. (fly plane3 city0 city3 fl3 fl2)
   deleted: (at plane3 city0) (fuel-level plane3 fl3)
   added: (at plane3 city3) (fuel-level plane3 fl2)
   goals met: 8 of 27
20. (zoom plane3 city3 city13 fl2 fl1 fl0)
   deleted: (at plane3 city3) (fuel-level plane3 fl2)
   added: (at plane3 city13) (fuel-level plane3 fl0)
   goals met: 8 of 27
21. (debark person10 plane3 city13)
   deleted: (in person10 plane3)
   added: (at person10 city13)
   goals met: 9 of 27
22. (fly plane1 city4 city12 fl1 fl0)
   deleted: (at plane1 city4) (fuel-level plane1 fl1)
   added: (at plane1 city12) (fuel-level plane1 fl0)
   goals met: 9 of 27
23. (refuel plane1 city12 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 9 of 27
24. (board person20 plane1 city12)
   deleted: (at person20 city12)
   added: (in person20 plane1)
   goals met: 9 of 27
25. (debark person23 plane1 city12)
   deleted: (in person23 plane1)
   added: (at person23 city12)
   goals met: 10 of 27
26. (fly plane1 city12 city14 fl1 fl0)
   deleted: (at plane1 city12) (fuel-level plane1 fl1)
   added: (at plane1 city14) (fuel-level plane1 fl0)
   goals met: 10 of 27
27. (refuel plane1 city14 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 10 of 27
28. (debark person20 plane1 city14)
   deleted: (in person20 plane1)
   added: (at person20 city14)
   goals met: 11 of 27
29. (fly plane1 city14 city11 fl1 fl0)
   deleted: (at plane1 city14) (fuel-level plane1 fl1)
   added: (at plane1 city11) (fuel-level plane1 fl0)
   goals met: 12 of 27
30. (fly plane5 city1 city8 fl1 fl0)
   deleted: (at plane5 city1) (fuel-level plane5 fl1)
   added: (at plane5 city8) (fuel-level plane5 fl0)
   goals met: 12 of 27
31. (refuel plane5 city8 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 12 of 27
32. (board person13 plane5 city8)
   deleted: (at person13 city8)
   added: (in person13 plane5)
   goals met: 12 of 27
33. (board person15 plane5 city8)
   deleted: (at person15 city8)
   added: (in person15 plane5)
   goals met: 12 of 27
34. (board person21 plane5 city8)
   deleted: (at person21 city8)
   added: (in person21 plane5)
   goals met: 12 of 27
35. (fly plane5 city8 city15 fl1 fl0)
   deleted: (at plane5 city8) (fuel-level plane5 fl1)
   added: (at plane5 city15) (fuel-level plane5 fl0)
   goals met: 12 of 27
36. (refuel plane5 city15 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 12 of 27
37. (board person22 plane5 city15)
   deleted: (at person22 city15)
   added: (in person22 plane5)
   goals met: 12 of 27
38. (fly plane5 city15 city6 fl1 fl0)
   deleted: (at plane5 city15) (fuel-level plane5 fl1)
   added: (at plane5 city6) (fuel-level plane5 fl0)
   goals met: 12 of 27
39. (refuel plane5 city6 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 12 of 27
40. (board person3 plane5 city6)
   deleted: (at person3 city6)
   added: (in person3 plane5)
   goals met: 12 of 27
41. (board person6 plane5 city6)
   deleted: (at person6 city6)
   added: (in person6 plane5)
   goals met: 12 of 27
42. (board person12 plane5 city6)
   deleted: (at person12 city6)
   added: (in person12 plane5)
   goals met: 12 of 27
43. (board person24 plane5 city6)
   deleted: (at person24 city6)
   added: (in person24 plane5)
   goals met: 12 of 27
44. (fly plane5 city6 city16 fl1 fl0)
   deleted: (at plane5 city6) (fuel-level plane5 fl1)
   added: (at plane5 city16) (fuel-level plane5 fl0)
   goals met: 12 of 27
45. (refuel plane5 city16 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 12 of 27
46. (debark person6 plane5 city16)
   deleted: (in person6 plane5)
   added: (at person6 city16)
   goals met: 13 of 27
47. (fly plane5 city16 city3 fl1 fl0)
   deleted: (at plane5 city16) (fuel-level plane5 fl1)
   added: (at plane5 city3) (fuel-level plane5 fl0)
   goals met: 13 of 27
48. (refuel plane5 city3 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 13 of 27
49. (board person2 plane5 city3)
   deleted: (at person2 city3)
   added: (in person2 plane5)
   goals met: 13 of 27
50. (board person8 plane5 city3)
   deleted: (at person8 city3)
   added: (in person8 plane5)
   goals met: 13 of 27
51. (debark person13 plane5 city3)
   deleted: (in person13 plane5)
   added: (at person13 city3)
   goals met: 14 of 27
52. (fly plane5 city3 city1 fl1 fl0)
   deleted: (at plane5 city3) (fuel-level plane5 fl1)
   added: (at plane5 city1) (fuel-level plane5 fl0)
   goals met: 14 of 27
53. (refuel plane5 city1 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 14 of 27
54. (debark person2 plane5 city1)
   deleted: (in person2 plane5)
   added: (at person2 city1)
   goals met: 15 of 27
55. (fly plane5 city1 city4 fl1 fl0)
   deleted: (at plane5 city1) (fuel-level plane5 fl1)
   added: (at plane5 city4) (fuel-level plane5 fl0)
   goals met: 15 of 27
56. (refuel plane5 city4 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 15 of 27
57. (debark person22 plane5 city4)
   deleted: (in person22 plane5)
   added: (at person22 city4)
   goals met: 16 of 27
58. (fly plane5 city4 city0 fl1 fl0)
   deleted: (at plane5 city4) (fuel-level plane5 fl1)
   added: (at plane5 city0) (fuel-level plane5 fl0)
   goals met: 16 of 27
59. (refuel plane5 city0 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 16 of 27
60. (debark person8 plane5 city0)
   deleted: (in person8 plane5)
   added: (at person8 city0)
   goals met: 17 of 27
61. (fly plane5 city0 city17 fl1 fl0)
   deleted: (at plane5 city0) (fuel-level plane5 fl1)
   added: (at plane5 city17) (fuel-level plane5 fl0)
   goals met: 17 of 27
62. (refuel plane5 city17 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 17 of 27
63. (board person25 plane5 city17)
   deleted: (at person25 city17)
   added: (in person25 plane5)
   goals met: 17 of 27
64. (debark person12 plane5 city17)
   deleted: (in person12 plane5)
   added: (at person12 city17)
   goals met: 18 of 27
65. (debark person19 plane5 city17)
   deleted: (in person19 plane5)
   added: (at person19 city17)
   goals met: 19 of 27
66. (debark person21 plane5 city17)
   deleted: (in person21 plane5)
   added: (at person21 city17)
   goals met: 20 of 27
67. (fly plane5 city17 city2 fl1 fl0)
   deleted: (at plane5 city17) (fuel-level plane5 fl1)
   added: (at plane5 city2) (fuel-level plane5 fl0)
   goals met: 20 of 27
68. (refuel plane5 city2 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 20 of 27
69. (board person11 plane5 city2)
   deleted: (at person11 city2)
   added: (in person11 plane5)
   goals met: 20 of 27
70. (debark person25 plane5 city2)
   deleted: (in person25 plane5)
   added: (at person25 city2)
   goals met: 21 of 27
71. (fly plane5 city2 city13 fl1 fl0)
   deleted: (at plane5 city2) (fuel-level plane5 fl1)
   added: (at plane5 city13) (fuel-level plane5 fl0)
   goals met: 21 of 27
72. (refuel plane5 city13 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 21 of 27
73. (board person5 plane5 city13)
   deleted: (at person5 city13)
   added: (in person5 plane5)
   goals met: 21 of 27
74. (board person9 plane5 city13)
   deleted: (at person9 city13)
   added: (in person9 plane5)
   goals met: 21 of 27
75. (debark person3 plane5 city13)
   deleted: (in person3 plane5)
   added: (at person3 city13)
   goals met: 22 of 27
76. (debark person11 plane5 city13)
   deleted: (in person11 plane5)
   added: (at person11 city13)
   goals met: 23 of 27
77. (debark person15 plane5 city13)
   deleted: (in person15 plane5)
   added: (at person15 city13)
   goals met: 24 of 27
78. (debark person24 plane5 city13)
   deleted: (in person24 plane5)
   added: (at person24 city13)
   goals met: 25 of 27
79. (fly plane5 city13 city0 fl1 fl0)
   deleted: (at plane5 city13) (fuel-level plane5 fl1)
   added: (at plane5 city0) (fuel-level plane5 fl0)
   goals met: 25 of 27
80. (refuel plane5 city0 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 25 of 27
81. (debark person5 plane5 city0)
   deleted: (in person5 plane5)
   added: (at person5 city0)
   goals met: 26 of 27
82. (fly plane5 city0 city17 fl1 fl0)
   deleted: (at plane5 city0) (fuel-level plane5 fl1)
   added: (at plane5 city17) (fuel-level plane5 fl0)
   goals met: 26 of 27
83. (debark person9 plane5 city17)
   deleted: (in person9 plane5)
   added: (at person9 city17)
   goals met: 27 of 27
